app/controllers/products_controller.rb

SELECT "products".* FROM "products"
---
  def index
    @products = Product.all

INSERT INTO "products" ("name", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Aldo"], ["price", 1000], ["created_at", "2015-07-10 00:22:36.442902"], ["updated_at", "2015-07-10 00:22:36.442902"]]
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_product
      @product = Product.find(params[:id])